# Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A.
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. 
# В последующих  строках записаны N целых чисел Ai (можно использовать псевдогенерацию). 
# Последняя строка содержит число X.

# n = int(input("Введите количество элементов в массиве: "))
# a = []
# for i in range(n):
#     a.append(int(input(f"Введите {i + 1}-й элемент массива: ")))
# x = int(input("Введите число X: "))
# count = 0
# for i in a:
#     if i == x:
#         count += 1
# print(f"Число {x} встречается в массиве {count} раз(а).")



